app/controllers/admin/dashboard_controller.rb

  def index
    @total_rooms        = Current.organization.rooms.active.count
    @today_reservations = Current.organization.reservations.where(date: Date.current).count
    @this_month         = Current.organization.reservations
                                 .where(date: Date.current.beginning_of_month..Date.current.end_of_month)
                                 .count
---
SELECT COUNT(*) FROM "rooms" WHERE "rooms"."organization_id" = 2 AND "rooms"."active" = TRUE
SELECT COUNT(*) FROM "reservations" INNER JOIN "rooms" ON "reservations"."room_id" = "rooms"."id" WHERE "rooms"."organization_id" = 2 AND "reservations"."date" = '2026-02-28'
SELECT COUNT(*) FROM "reservations" INNER JOIN "rooms" ON "reservations"."room_id" = "rooms"."id" WHERE "rooms"."organization_id" = 2 AND "reservations"."date" BETWEEN '2026-02-01' AND '2026-02-28'