app/controllers/admin/reservations_controller.rb

  def index
    @date   = params[:date].present? ? Date.parse(params[:date]) : Date.current
    @reservations = Current.organization.reservations
                           .includes(:room)
                           .where(date: @date)
                           .order(:start_time)
---
SELECT "reservations".* FROM "reservations" INNER JOIN "rooms" ON "reservations"."room_id" = "rooms"."id" WHERE "rooms"."organization_id" = 2 AND "reservations"."date" = '2026-02-28' ORDER BY "reservations"."start_time" ASC