app/controllers/admin/rooms_controller.rb

  def index
    @rooms = Current.organization.rooms.order(:floor, :name)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."organization_id" = 2 ORDER BY "rooms"."floor" ASC, "rooms"."name" ASC

  def create
    @room = Current.organization.rooms.new(room_params)
    if @room.save
---
INSERT INTO "rooms" ("active", "capacity", "created_at", "floor", "name", "organization_id", "updated_at") VALUES (TRUE, 10, '2026-02-28 14:15:30.981356', '9층', '회의실', 2, '2026-02-28 14:15:30.981356') RETURNING "id"

  def set_room
    @room = Current.organization.rooms.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."organization_id" = 2 AND "rooms"."id" = 3 LIMIT 1

  def check_room_limit
    plan  = Current.organization.plan
    limit = plan&.room_limit
    return unless limit
    if Current.organization.rooms.active.count >= limit
---
SELECT COUNT(*) FROM "rooms" WHERE "rooms"."organization_id" = 2 AND "rooms"."active" = TRUE