app/controllers/admin/subscriptions_controller.rb

SELECT "plans".* FROM "plans" ORDER BY "plans"."price_cents" ASC
---
  def show
    @billing_error = nil
    reconcile_checkout_session if params[:session_id].present?
    @subscription = Current.organization.subscription
    @current_plan = Current.organization.plan
    @plans        = Plan.all.order(:price_cents)

SELECT "plans".* FROM "plans" WHERE "plans"."id" = 1 LIMIT 1
---
  def create
    plan = Plan.find(params[:plan_id])