app/controllers/super_admin/organizations_controller.rb

  def index
    @organizations = Organization.includes(:plan, :subscription).order(created_at: :desc)
---
SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."created_at" DESC

  def create
    @organization = Organization.new(organization_params)
    if @organization.save
---
INSERT INTO "organizations" ("name", "subdomain", "stripe_customer_id", "active", "plan_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"