app/controllers/super_admin/plans_controller.rb

INSERT INTO "plans" ("name", "price_cents", "room_limit", "stripe_price_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @plan = Plan.new(plan_params)
    if @plan.save

SELECT 1 AS one FROM "organizations" WHERE "organizations"."plan_id" = $1 LIMIT $2  [["plan_id", 221168073], ["LIMIT", 1]]
---
  def destroy
    if @plan.organizations.exists? || @plan.subscriptions.exists?

SELECT "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 221168073], ["LIMIT", 1]]
---
  def set_plan
    @plan = Plan.find(params[:id])