app/controllers/application_controller.rb

  def set_current_tenant
    subdomain = request.subdomain.presence
    return unless subdomain

    Current.organization = Organization.find_by!(subdomain: subdomain, active: true)
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."subdomain" = 'demo' AND "organizations"."active" = TRUE LIMIT 1