app/controllers/registrations_controller.rb

  def create
    @organization = Organization.new(org_params)
    @user         = User.new(user_params.merge(role: :org_admin, organization: @organization))

    ActiveRecord::Base.transaction do
      free_plan = Plan.find_by!(name: "free")
      @organization.plan = free_plan
      @organization.save!
      @user.save!
      @organization.create_subscription!(
        plan:               free_plan,
        status:             "active",
        current_period_end: 100.years.from_now
      )
---
SELECT "plans".* FROM "plans" WHERE "plans"."name" = 'free' LIMIT 1
INSERT INTO "organizations" ("name", "subdomain", "stripe_customer_id", "active", "plan_id", "created_at", "updated_at") VALUES ('부산대병원', 'abc-h', NULL, TRUE, 1, '2026-02-28 13:18:26.544548', '2026-02-28 13:18:26.544548') RETURNING "id"
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "organization_id", "role") VALUES ('dovi0628@gmail.com', '$2a$12$3ba9.4DuPJwqEANJO2TG0OpROx5oYxWAO2TNqN06Ob8bruxG/2H.m', NULL, NULL, NULL, '2026-02-28 13:18:26.559025', '2026-02-28 13:18:26.559025', 2, 1) RETURNING "id"
INSERT INTO "subscriptions" ("organization_id", "plan_id", "stripe_subscription_id", "status", "current_period_end", "created_at", "updated_at") VALUES (2, 1, NULL, 'active', '2126-02-28 13:18:26.563736', '2026-02-28 13:18:26.584555', '2026-02-28 13:18:26.584555') RETURNING "id"