app/controllers/reservations_controller.rb

SELECT DISTINCT "rooms"."floor" FROM "rooms" WHERE "rooms"."organization_id" = 1 AND "rooms"."active" = TRUE
SELECT "rooms".* FROM "rooms" WHERE "rooms"."organization_id" = 1 AND "rooms"."active" = TRUE AND "rooms"."floor" = '1층'
SELECT "reservations".* FROM "reservations" WHERE "reservations"."room_id" IN (SELECT "rooms"."id" FROM "rooms" WHERE "rooms"."organization_id" = 1 AND "rooms"."active" = TRUE AND "rooms"."floor" = '1층') AND "reservations"."date" = '2026-02-28' ORDER BY "reservations"."start_time" ASC
---
  def index
    @date   = params[:date].present? ? Date.parse(params[:date]) : Date.current
    @floors = Current.organization.rooms.active.distinct.pluck(:floor).sort
    @floor  = params[:floor] || @floors.first
    @rooms  = @floor ? Current.organization.rooms.active.where(floor: @floor) : []
    @reservations = @floor ? Reservation.where(room: @rooms, date: @date)
                                        .includes(:room)
                                        .order(:start_time) : []