app/controllers/webhooks_controller.rb

  def stripe
    payload    = request.body.read
    sig_header = request.env["HTTP_STRIPE_SIGNATURE"]

    event = Stripe::Webhook.construct_event(
      payload, sig_header, stripe_webhook_secret
    )

    case event.type
    when "checkout.session.completed"
      handle_checkout_completed(event.data.object)
    when "customer.subscription.updated"
---
UPDATE "subscriptions" SET "plan_id" = $1, "current_period_end" = $2, "updated_at" = $3 WHERE "subscriptions"."id" = $4  [["plan_id", 276395353], ["current_period_end", "2026-04-28 13:09:58"], ["updated_at", "2026-02-28 13:09:58.517219"], ["id", 3]]

  def handle_checkout_completed(session)
    org = Organization.find_by(id: session.metadata["organization_id"])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 1 LIMIT 1