app/models/organization.rb

  def self.subdomain_available?(value)
    candidate = normalize_subdomain(value)
    return false if candidate.blank?
---
SELECT 1 AS one FROM "organizations" WHERE "organizations"."subdomain" = 'abs' LIMIT 1