app/models/reservation.rb

  def no_time_overlap
    return unless room && date && start_time && end_time
    overlapping = Reservation.where(room_id: room_id, date: date)
                             .where.not(id: id)
                             .where("start_time < ? AND end_time > ?", end_time, start_time)
                             .lock
    errors.add(:base, "해당 시간에 이미 예약이 있습니다.") if overlapping.exists?
---
SELECT 1 AS one FROM "reservations" WHERE "reservations"."room_id" = 1 AND "reservations"."date" = '2026-03-01' AND "reservations"."id" IS NOT NULL AND (start_time < '2000-01-01 02:00:00' AND end_time > '2000-01-01 01:00:00') LIMIT 1 FOR UPDATE